Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadCombination.SetLoads Method
 Sets the loads.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetLoads(
	List<Identifier> groupIDs,
	List<double> scalingFactors,
	List<double> reductionFactors,
	List<double> partialSafetyFactors
)
Public Sub SetLoads (
	groupIDs As List(Of Identifier),
	scalingFactors As List(Of Double),
	reductionFactors As List(Of Double),
	partialSafetyFactors As List(Of Double)
)
Parameters
groupIDs
Type: System.Collections.Generic.List<Identifier>
The group identifiers.
scalingFactors
Type: System.Collections.Generic.List<Double>
The scaling factors.
reductionFactors
Type: System.Collections.Generic.List<Double>
The reduction factors.
partialSafetyFactors
Type: System.Collections.Generic.List<Double>
The partial safety factors.
See Also
Reference
AnalysisLoadCombination Class
Tekla.Structures.Analysis Namespace